* completion-style?
이맥스에서 completion이란 보통 자동 완성 기능을 의미한다.

completion-styles라는 변수로 설정이 가능하다.
#+begin_src emacs-lisp
completion-styles
#+end_src

#+RESULTS:
| basic | partial-completion | emacs22 |

​~completion-styles~​에 쓰일 수 있는 값들은 ​~completion-styles-alist~​에 지정되어 있다.
#+begin_src emacs-lisp :results verbatim
completion-styles-alist
#+end_src

(​=_=​는 커서 위치)
** emacs21
단순 접두사 기반.
​=foo_bar=​ -> ​=foobar*=​

** emacs22
커서 이전의 텍스트만 접두사로 사용한다.
​=foo_bar=​ -> ​=foo*=​ 그리고 bar를 뒤에 더한다.

** basic
커서 앞을 접두사로, 뒤를 접미사로 완성 후보를 찾는다.
​=foo_bar=​ -> ​=foo* bar*=​

** partial-completion
여러 단어를 각각 접두사로 사용한다.
​=l-co_h=​ -> ​=l* co* h*=​
또한, 하위 필드에서 단계별로 수행되는 완성의 경우 메소드는 일치하지 않는 모든 이전 필드에 적용된다.
​=/u/l/b=​ -> ​=/usr/local/bin=​

** substring
substring으로 string 완성.
​=foo_bar=​ -> ​=*foo*bar*=​

** flex
문자 부분 집합으로 순차 완성
​=foo=​ -> ​=f*o*o*=​
e.g.
​=foo=​ -> ​=frodo=​

** initials
두문자어 및 이니셜 완성
e.g.
​=lch=​ -> ​=list-command-history=​
​=~/sew=​ -> ​=~/src/emacs/work=​


* pcomplete
pcomplete는 이맥스에 내장된 프로그래밍 가능한 완료 라이브러리다. eshell 등에서 완성을 위해 사용할 수 있다.
[[https://www.masteringemacs.org/article/pcomplete-context-sensitive-completion-emacs]]
